###. This block is used by the Help File generator -- #####
you don't need to include it in your own Textile documents.
page_title => Notes
sort_order => 70
###########################################################

h1. Note and note-list syntax

###. The Textile synax examples below are enclosed in <pre> blocks. 
     This is so the Textile markup can be seen in the HTML output
     from this file.

Textile note syntax allows you to apply linked notes throughout a document,
 leaving Textile to automatically generate a consolidated note list. Linked 
 notes are composed of three parts:

* a set of named [_definitions_]
* a set of _references_ to those definitions
* one or more _placeholders_ for the generated note lists

h2. Definitions

Each note definition must occur in its own block:

pre. 
note#example-label. Your definition text here.

The note label must consist only of letters, numbers, colons, and dashes.

h2. References

Each note reference is marked in your text with square brackets
 surrounding the note label (note IDs are randomised):

pre. 
As stated in Fowler [#example-label]

bc. As stated in Fowler <sup><a href="#note4157477"><span id="noteref76302895">1</span></a></sup>

h2. List Placeholders

Place a note list anywhere in your document with this syntax:

pre. 
notelist.

This accepts the usual Textile attributes:

pre. 
notelist(class#id).

By default, the note list will list definitions in the order they are
 referenced in the text. Each definition has a full list of backlinks to
 each reference. The backlinks can be partially or fully disabled:

pre. 
notelist(class#id)!.    (no backlinks)
notelist(class#id)^.    (only the first backlink)

Backlinking settings can also be applied to individual note definitions:

pre. 
note#label!.    (no backlinks)
note#label^.    (first backlink only)
note#label*.    (all backlinks, even if note list has backlinking disabled)

Note definitions not actually referenced in the document will be left out
 of the list unless you force the note list to include them:

pre. 
notelist+.      (list all notes, even unreferenced ones)

When applying multiple controls to a note list, put them in this order:

* standard attributes
* backlink setting
* unreferenced note setting

pre. 
notelist+^(#main).

h2. Example

pre.. 
Scientists say[#lavader] the moon is small.

note#other. An unreferenced note.

note#lavader. "Proof":url of a small moon.

...

notelist(#footnotes)+.

bc. <p>Scientists say<sup><a href="#note194377">
    <span id="noteref122059">1</span></a></sup> the moon is small.</p>
...
<ol id="footnotes">
<li><a href="#noteref1220591"><sup>a</sup></a><span id="note1943776">
    </span><a href="url">Proof</a> of a small moon.</li>
<li>An unreferenced note.</li>
</ol>

The 'a b c' backlink characters can be customised.
For example, to have numeric backlinks starting from 1:

pre. 
notelist:1.
